Documents/Событие.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Document>
		<Properties>
			<Name>Событие</Name>
			<BasedOn>
				<xr:Item>Document.Заявка</xr:Item>
				<xr:Item>Document.Событие</xr:Item>
				<xr:Item>Document.ЛистОжидания</xr:Item>
				<xr:Item>Task.ЗадачиПользователя</xr:Item>
				<xr:Item>Document.ОбратнаяСвязь</xr:Item>
			</BasedOn>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Филиал</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Филиалы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОснованиеСобытия</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Клиенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидСобытия</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыСобытий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПлан</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаФакт</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Цель</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипЗвонка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыЗвонков</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсходЗвонка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИсходыЗвонка</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УспешностьЗвонка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗвонокНачат</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗвонокЗавершен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерТелефона</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДлительностьЗвонка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СозданАвтоматически</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаписьРазговора</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>удалитьВидЗвонка</Name>
					<Type>
						<v8:Type>cfg:EnumRef.фонВидыЗвонков</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПлановыйИсполнитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФактическийИсполнитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>доп_НабранныйНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипРекламы</Name>
					<Comment>UTM_MEDIUM</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыРекламы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсточникИнформации</Name>
					<Comment>UTM_SOURCE</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ИсточникиИнформации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РекламнаяКомпания</Name>
					<Comment>UTM_CAMPAIGN</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.РекламныеКомпании</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлючевоеСловоРекламнойКомпании</Name>
					<Comment>UTM_TERM</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СодержаниеОбъявления</Name>
					<Comment>UTM_CONTENT</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>омг_Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>омг_ЭтоПервичныйПрием</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Направление</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТемаОбращенийУслуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТемаОбращенийУслуга</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УслугиНетВПрайсе</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УслугаБезПрайса</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПриема</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыПриемов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаправлениеНовый</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыНаправлений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Работы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>омг_Набор</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>омг_НаборУровень</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>омг_НаборЛИС</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/ИсходыТиповЗвонковДопустимые.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<InformationRegister>
		<Properties>
			<Name>ИсходыТиповЗвонковДопустимые</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>ТипЗвонка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыЗвонков</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИсходЗвонка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИсходыЗвонка</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/НастройкиПользователей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<InformationRegister>
		<Properties>
			<Name>НастройкиПользователей</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.НастройкиПользователей</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Настройка</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.НастройкиПользователей</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/НеотработанныеОбращения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<InformationRegister>
		<Properties>
			<Name>НеотработанныеОбращения</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЛистОжидания</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ВидыСобытий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Enum>
		<Properties>
			<Name>ВидыСобытий</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВходящееПисьмо</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИсходящееПисьмо</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВходящийЗвонок</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИсходящийЗвонок</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЛичнаяВстреча</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ТипыКонтактнойИнформации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Enum>
		<Properties>
			<Name>ТипыКонтактнойИнформации</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Телефон</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Адрес</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АдресЭлектроннойПочты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Skype</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВебСтраница</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Факс</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Другое</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВидыНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Enum>
		<Properties>
			<Name>ВидыНоменклатуры</Name>
			<Comment>Виды номенклатуры</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Материал</Name>
					<Comment>Основной вид ТМЦ, учитываемый на складах</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Услуга</Name>
					<Comment>Услуга, не хранится на складах</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Набор</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВидыПриемов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Enum>
		<Properties>
			<Name>ВидыПриемов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Первичный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Вторичный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Иной</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВидыНаправлений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Enum>
		<Properties>
			<Name>ВидыНаправлений</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Платно</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Страховка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Другое</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/ИсходыЗвонка.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Catalog>
		<Properties>
			<Name>ИсходыЗвонка</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>СоздаватьЛистОжидания</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбщениеСостоялось</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеСоздаватьЛид</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Documents/Событие/Forms/ФормаДокумента/Ext/Form/Module.bsl
#Область РазделОписанияПеременных

&НаКлиенте
Перем ТелефоныКлиента;

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	РаботаСФормамиСервер.ФормаДокументаПриОткрытииСервер(ЭтаФорма, Ложь);
	
	ИспользоватьCallЦентр = Метаданные.ФункциональныеОпции.Найти("ИспользоватьCallЦентр") <> Неопределено И ПолучитьФункциональнуюОпцию("ИспользоватьCallЦентр");
	
	ЭтоНовый = Объект.Ссылка.Пустая();	
	Если ЭтоНовый Тогда
		Если Не ЗначениеЗаполнено(Объект.Ответственный) Тогда 
			Объект.Ответственный = ПараметрыСеанса.ТекущийПользователь;
		КонецЕсли;
		//Добавлено Карсаков
		Если Не ЗначениеЗаполнено (Объект.омг_Организация) Тогда
			Филиал = ПолучитьФилиалПользователя();
			Если Филиал <> Неопределено Тогда
				Объект.омг_Организация = Филиал
			КонецЕсли;
		КонецЕсли; 
		Объект.омг_ЭтоПервичныйПрием = Истина;
		Объект.Направление = Истина;
		
		//
	КонецЕсли;
	
	Элементы.Основание.ТолькоПросмотр = ЗначениеЗаполнено(Объект.Основание);
	
	ДопСвойства = Новый Структура;
	Если Не ЗначениеЗаполнено(Объект.Клиент)
		И ЗначениеЗаполнено(Объект.Основание)
		И ТипЗнч(Объект.Основание) = Тип("ДокументСсылка.ЛистОжидания")
		И ЗначениеЗаполнено(Объект.Основание.Клиент)
		И ПравоДоступа("Редактирование", Объект.Ссылка.Метаданные())
	Тогда 
		Объект.Клиент = Объект.Основание.Клиент;
		Модифицированность = Истина;
		ДопСвойства.Вставить("АвтоподстановкаКлиентаИзОснования", Истина);
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	ИсходыТиповЗвонков = РегистрыСведений.ИсходыТиповЗвонковДопустимые.СоздатьНаборЗаписей();
	ИсходыТиповЗвонков.Прочитать();
	ИсходыПоТипуЗвонка.Загрузить(ИсходыТиповЗвонков.Выгрузить());
	УстановитьПривилегированныйРежим(Ложь);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТипыЗвонков.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ТипыЗвонков КАК ТипыЗвонков
		|ГДЕ
		|	ТипыЗвонков.ИсходОбязателен = ИСТИНА";
	
	ТипыЗвонкаСОбязательнымИсходом.ЗагрузитьЗначения(Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка"));
	
	Элементы.Дата.Доступность = РольДоступна("ПолныеПрава") Или РольДоступна("доп_ПользовательБИТфон");
	
	ПоказатьКомментарииКлиента(Объект.Клиент, Элементы.ДекорацияПодсказкаКлиента, Элементы.СтраницыКомментария, Элементы.СтраницаКнопкаКомментарий, Элементы.СтраницаГиперссылкаКомментарий);
	
	ТекстСпециализации = "";
	
	Для каждого строкаСпециализации из Объект.Работы Цикл
		
		ТекстСпециализации = ТекстСпециализации + строкаСпециализации.Номенклатура + "; ";
	
	КонецЦикла;  
	
	Элементы.Декорация2.Заголовок = "Услуги по прайсу: " +ТекстСпециализации;
	РаботаСФормамиСервер.НастройкаПодбораПриСоздании(ЭтаФорма, Истина, "Работы", "Услуга", "Набор"); 
	ЭтаФорма.РеквизитСписокПодбор.Параметры.УстановитьЗначениеПараметра("Омг_ТолькоСЦенами",Истина);
	//РаботаСформамиКЛиент.ОбновитьДинамическийСписокПринудительно(ЭтаФорма.РеквизитСписокПодбор);
	Элементы.ФормаЗаписатьИЗакрыть.ЦветФона = webцвета.Золотой;
	
КонецПроцедуры
//////////////Добавлено Карсаков///////////
&НаСервере
Функция ПолучитьФилиалПользователя()
	НастройкаОрганизация = ПланыВидовХарактеристик.НастройкиПользователей.омг_ОсновнаяОрганизация;
	Пользователь = ПараметрыСеанса.ТекущийПользователь;
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	НастройкиПользователей.Значение КАК Организация
	               |ИЗ
	               |	РегистрСведений.НастройкиПользователей КАК НастройкиПользователей
	               |ГДЕ
	               |	НастройкиПользователей.Пользователь = &Пользователь
	               |	И НастройкиПользователей.Настройка = &НастройкаОрганизация";
	Запрос.УстановитьПараметр("Пользователь", Пользователь);
	Запрос.УстановитьПараметр("НастройкаОрганизация", НастройкаОрганизация);
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	Если Выборка.Следующий() Тогда
	    ОсновнаяОрганизация = Выборка.Организация
	КонецЕсли;
    Возврат ОсновнаяОрганизация;
		
КонецФункции
/////////////////////////
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ПечатьДокументовКлиент.УстановитьЗаголовокПечатнойФормы(ЭтаФорма);
	
	НомерКартинкиВидаСобытия = ОбщегоНазначенияПереопределяемый.ПолучитьИндексЭлементаПеречисления(Объект.ВидСобытия);
	НастроитьВидимостьДоступность();
	
	ОбновитьПодсказкуНомераТелефона();
	
	Если ДопСвойства.Свойство("АвтоподстановкаКлиентаИзОснования") И ДопСвойства.АвтоподстановкаКлиентаИзОснования Тогда
		ПоказатьОповещениеПользователя(НСтр("ru='Была выполнена автоподстановка Клиента из основания текущего События'"));
	КонецЕсли;

	омг_ПослеВыбораНоменклатуры();
	омг_ПослеВыбораФилиала(" ","")
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(Объект.Ссылка)
		И ТипЗнч(Объект.Основание) <> Тип("ДокументСсылка.ЛистОжидания")
		И Не ЗавершениеРаботы
		И ОтсутствуютЛистыОжиданияВведенныеНаОсновании(Объект.Ссылка)
		И ЗначениеЗаполнено(Объект.ИсходЗвонка) И ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.ИсходЗвонка, "СоздаватьЛистОжидания")
	Тогда
		ЗначенияЗаполнения = CRMСервер.ПолучитьЗначенияЗаполненияДляЛистаОжиданияПоОбъекту(Объект.Ссылка);
		ПараметрыФормы = Новый Структура("Клиент, ЗначенияЗаполнения, ДатаНачала", Объект.Клиент, ЗначенияЗаполнения, ТекущаяДата());
		ОткрытьФорму("Документ.ЛистОжидания.Форма.ФормаБыстрогоСоздания", ПараметрыФормы, ЭтотОбъект);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи) 
		
	Если ТекущийОбъект.ТипЗвонка.ИсходОбязателен И Не ЗначениеЗаполнено(ТекущийОбъект.ИсходЗвонка) Тогда
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Не заполнен исход звонка'"),,"Объект.ИсходЗвонка");
		Отказ = Истина;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ТекущийОбъект.ДатаПлан) И Не ЗначениеЗаполнено(ТекущийОбъект.ДатаФакт) Тогда 
		ТекущийОбъект.ДатаФакт = ТекущийОбъект.Дата;
		
		Если Не ЗначениеЗаполнено(ТекущийОбъект.ФактическийИсполнитель) Тогда
			ТекущийОбъект.ФактическийИсполнитель = ОбщегоНазначения.ТекущийПользователь();	
		КонецЕсли;
	КонецЕсли;
	
	Если ТекущийОбъект.ВидСобытия = Перечисления.ВидыСобытий.ВходящееПисьмо Или
		ТекущийОбъект.ВидСобытия = Перечисления.ВидыСобытий.ВходящийЗвонок 
	Тогда
		Если ЗначениеЗаполнено(ТекущийОбъект.ПлановыйИсполнитель) Тогда
		    ТекущийОбъект.ПлановыйИсполнитель = Неопределено;
		КонецЕсли;
		Если ЗначениеЗаполнено(ТекущийОбъект.ДатаПлан) Тогда
		    ТекущийОбъект.ДатаПлан = Дата(1,1,1);
		КонецЕсли;
	КонецЕсли;
	
	Если ОбновитьСотовыйКлиента И ЗначениеЗаполнено(Объект.Клиент) Тогда
		ТекущийОбъект.ДополнительныеСвойства.Вставить("ОбновитьСотовыйКлиента", Истина);
		ДопСвойства.Удалить("ОбновитьСотовыйКлиента");
		ОбновитьСотовыйКлиента = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	РаботаСФормамиСервер.ВывестиЗаголовокФормыДокумента(Объект.Ссылка, Ложь, ЭтаФорма);
	
	Если ЗначениеЗаполнено(ТекущийОбъект.Основание)
		И ТипЗнч(ТекущийОбъект.Основание) = Тип("ДокументСсылка.ЛистОжидания")
	Тогда
		
		Если ЗначениеЗаполнено(ТекущийОбъект.Клиент)
			И НЕ ЗначениеЗаполнено(ТекущийОбъект.Основание.Клиент)
		Тогда
			УстановитьПривилегированныйРежим(Истина);
			ЛистОжидания = Объект.Основание.ПолучитьОбъект();
			ЛистОжидания.Клиент = ТекущийОбъект.Клиент;
			Попытка
				ЛистОжидания.Записать();
			Исключение
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Не удалось сохранить Клиента в основании События.'"));
			КонецПопытки;
			УстановитьПривилегированныйРежим(Ложь);
		КонецЕсли;
		
		Если ТекущийОбъект.ИсходЗвонка.ОбщениеСостоялось Тогда
			
			УстановитьПривилегированныйРежим(Истина);
			НаборЗаписей = РегистрыСведений.НеотработанныеОбращения.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.Документ.Установить(ТекущийОбъект.Основание);
			НаборЗаписей.Записать();
			УстановитьПривилегированныйРежим(Ложь);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "БитФон_ЗаписьНомераТелефонаКонтрагента" Тогда
		Если Не ЗначениеЗаполнено(Объект.Клиент) И Объект.НомерТелефона = Параметр Тогда 
			Объект.Клиент = Источник;
		КонецЕсли;
	ИначеЕсли ИмяСобытия = "ЗаявкаПоДокументуЗапись"
		И Параметр.ДокументЗаписи = Объект.Ссылка 
		И Не Объект.Ссылка.Пустая()
	Тогда
		Если Не ЗначениеЗаполнено(Объект.ИсходЗвонка) Тогда
			Объект.ИсходЗвонка = ПредопределенноеЗначение("Справочник.ИсходыЗвонка.ЗаписанНаПрием");
			ЭтаФорма.Модифицированность = Истина;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	Результат = "";
	Если ТипЗнч(ВыбранноеЗначение) = Тип("СправочникСсылка.Клиенты") Тогда
		Если ЗначениеЗаполнено(ВыбранноеЗначение) Тогда
			Объект.Клиент = ВыбранноеЗначение;
			ОбновитьПодсказкуНомераТелефона();
		КонецЕсли;	
	ИначеЕсли ТипЗнч(ВыбранноеЗначение) = Тип("Структура")
			И ВыбранноеЗначение.Свойство("Клиент")
			И ЗначениеЗаполнено(ВыбранноеЗначение.Клиент)
	Тогда
		Объект.Клиент = ВыбранноеЗначение.Клиент;
		ОбновитьПодсказкуНомераТелефона();
	КонецЕсли;
	
	Если Не ПустаяСтрока(Результат) Тогда 
		Предупреждение(Результат);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура КлиентПриИзменении(Элемент)
	
	Если Объект.ВидСобытия <> ПредопределенноеЗначение("Перечисление.ВидыСобытий.ВходящийЗвонок")
		Или Не ЗначениеЗаполнено(Объект.НомерТелефона)
	Тогда
		Объект.НомерТелефона = ?(ЗначениеЗаполнено(Объект.Клиент), ПолучитьНомерАвтоподстановки(), "");
	КонецЕсли;
	ОбновитьПодсказкуНомераТелефона();
	ПоказатьКомментарииКлиента(Объект.Клиент, Элементы.ДекорацияПодсказкаКлиента, Элементы.СтраницыКомментария, Элементы.СтраницаКнопкаКомментарий, Элементы.СтраницаГиперссылкаКомментарий);
	
	ОбновитьСотовыйКлиента = ЗначениеЗаполнено(Объект.Клиент) И ДопСвойства.Свойство("ОбновитьСотовыйКлиента"); // Для возможного автосохранения телефона клиенту.
	
КонецПроцедуры

&НаКлиенте
Процедура КлиентАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)

	РаботаСФормамиКлиент.ПолеВводаКлиентаАвтоПодбор(Текст, СтандартнаяОбработка, ДанныеВыбора);
	
КонецПроцедуры

&НаКлиенте
Процедура КлиентОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)

	РаботаСФормамиКлиент.ПолеВводаКлиентаАвтоПодбор(Текст, СтандартнаяОбработка, ДанныеВыбора);
	
КонецПроцедуры

&НаКлиенте
Процедура ВидСобытияПриИзменении(Элемент)
	НомерКартинкиВидаСобытия = ОбщегоНазначенияПереопределяемый.ПолучитьИндексЭлементаПеречисления(Объект.ВидСобытия);
	НастроитьВидимостьДоступность();
КонецПроцедуры

#КонецОбласти

// Команды

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ДатаФактТекущая(Команда)
	
	Объект.ДатаФакт = ТекущаяДата();
	
	Если Не ЗначениеЗаполнено(Объект.ФактическийИсполнитель) Тогда
		Объект.ФактическийИсполнитель = ОбщегоНазначения.ТекущийПользователь();	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КнопкаФилиалПриНажатии(Команда)
	
	// Добавлено Макеев (
	ОповещениеПослеВыбораФилиала = Новый ОписаниеОповещения("омг_ПослеВыбораФилиала", ЭтаФорма);
	// )
	// Изменено Макеев (
	РаботаСДиалогамиКлиент.ДиалогКнопкаФилиалПриНажатии(ЭтаФорма,, ОповещениеПослеВыбораФилиала);
	// )

КонецПроцедуры

&НаКлиенте
Процедура ПоискКлиентов(Команда)
	ФормаКлиента = ПолучитьФорму("ОбщаяФорма.ФормаПоискаКлиентаУпр",,ЭтаФорма);
	ФормаКлиента.Телефон = доп_ТелефонияКлиентСервер.СократитьНомерДляПоиска(доп_ТелефонияКлиентСервер.ОчиститьНомерТолькоЦифры(Объект.НомерТелефона));
	ФормаКлиента.Открыть();
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьТелефон(Команда)
	
	Объект.НомерТелефона = ПолучитьНомерАвтоподстановки();
	ОбновитьПодсказкуНомераТелефона();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьТелефон(Команда)
	
	СотовыйЕсть = ЕстьСотовыйТелефонУКлиента(Объект.Клиент);
	Если СотовыйЕсть Тогда
		ПараметрыФормы = Новый Структура("Клиент, Номер", Объект.Клиент, Объект.НомерТелефона);
		ОткрытьФорму("Документ.Событие.Форма.ФормаИзмененияТелефона", ПараметрыФормы,,,,,Новый ОписаниеОповещения("ПослеИзмененияНомера", ЭтотОбъект, ПараметрыФормы));
	Иначе
		КонтактнаяИнформацияСерверПереопределяемый.ЗаписатьНомерТелефона(Объект.Клиент, Объект.НомерТелефона);
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура НачатьРазговор(Команда)
	
	Если Не РаботаСДиалогамиКлиент.ЗаписатьНовыйОбъектВФорме(ЭтаФорма) Тогда 
		Возврат;
	КонецЕсли;
	
	ТекстСообщения = НСтр("ru='Нет данных для совершения звонка. Не заполнен клиент или не указан контактный телефон!'");
	Если Не ЗначениеЗаполнено(Объект.НомерТелефона) Тогда
		Если Не ЗначениеЗаполнено(Объект.Клиент) Тогда 
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			Возврат;
		КонецЕсли;
		Объект.НомерТелефона = ПолучитьНомерАвтоподстановки();
		ОбновитьПодсказкуНомераТелефона();
		Если Не ЗначениеЗаполнено(Объект.НомерТелефона) Тогда 
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			Возврат;
		КонецЕсли;
	КонецЕсли;	
	
	Если Команда.Имя = "НачатьРазговор" Тогда  
		доп_ТелефонияКлиентПереопределяемый.Позвонить(Объект.НомерТелефона, Объект.Ссылка);
	Иначе
		доп_ТелефонияКлиентПереопределяемый.ПозвонитьМонитор(Объект.НомерТелефона, Объект.Ссылка);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьКомментарийКлиента(Команда)
	
	Если ЗначениеЗаполнено(Объект.Клиент) Тогда
	    ПараметрыФормы = Новый Структура("Клиент", Объект.Клиент);
    	ОткрытьФорму("Отчет.КалендарьПланирования.Форма.ФормаКомментарииКлиента",ПараметрыФормы,,,,,Новый ОписаниеОповещения("ПоказатьКомментарииКлиентаПослеИзменения", ЭтотОбъект));
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьТекПользователяКакПлан(Команда)
	
	Если Объект.ВидСобытия <> ПредопределенноеЗначение("Перечисление.ВидыСобытий.ВходящееПисьмо") И
		Объект.ВидСобытия <> ПредопределенноеЗначение("Перечисление.ВидыСобытий.ВходящийЗвонок") 
	Тогда
		Объект.ПлановыйИсполнитель = ОбщегоНазначения.ТекущийПользователь();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьТелефонЗаконномуПредставителю(Команда)
	
	Если ЗначениеЗаполнено(Объект.Клиент) Тогда
		ЗаконныйПредставитель = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Клиент, "ЗаконныйПредставитель");
		Если ЗначениеЗаполнено(ЗаконныйПредставитель) Тогда
			// Определяем существующий номер телефона представителя
			Если ТипЗнч(ЗаконныйПредставитель) = Тип("Строка") Тогда
				СтарыйНомерТелефона = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Клиент, "ЗаконныйПредставительТелефон");
			Иначе
				СтарыйНомерТелефона = КонтактнаяИнформацияСерверПереопределяемый.НайтиКонтактнуюИнформацию(ЗаконныйПредставитель,
					ПредопределенноеЗначение("Перечисление.ТипыКонтактнойИнформации.Телефон"), ПредопределенноеЗначение("Справочник.ВидыКонтактнойИнформации.ТелефонСотовый"),,Ложь);
			КонецЕсли;
			Если СтарыйНомерТелефона <> Объект.НомерТелефона Тогда
				Если НЕ ЗначениеЗаполнено(СтарыйНомерТелефона) Тогда
					Если ТипЗнч(ЗаконныйПредставитель) = Тип("Строка") Тогда
						ЗаписатьТелефонЗаконномуПредставителюНаСервере(Объект.Клиент, ЗаконныйПредставитель, Объект.НомерТелефона);
					Иначе
						ПараметрыФормы = Новый Структура("Клиент, Номер", ЗаконныйПредставитель, Объект.НомерТелефона);
						ОткрытьФорму("Документ.Событие.Форма.ФормаИзмененияТелефона", ПараметрыФормы,,,,,Новый ОписаниеОповещения("ПослеИзмененияНомера", ЭтотОбъект, ПараметрыФормы));
					КонецЕсли;
				Иначе
					ПараметрыФормы = Новый Структура("Клиент, Номер", ЗаконныйПредставитель, Объект.НомерТелефона);
					ОткрытьФорму("Документ.Событие.Форма.ФормаИзмененияТелефона", ПараметрыФормы,,,,,Новый ОписаниеОповещения("ПослеИзмененияНомера", ЭтотОбъект, ПараметрыФормы));	
				КонецЕсли;
			Иначе
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Данный номер уже содержится в списке номеров законного представителя (" + Строка(ЗаконныйПредставитель) + ")");		
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры
#КонецОбласти

&НаКлиенте
Процедура ПослеИзмененияНомера(РезультатЗакрытия, ДополнительныеПараметры) Экспорт
	
	Объект.НомерТелефона = ПолучитьНомерАвтоподстановки();
	ОбновитьПодсказкуНомераТелефона();
	
КонецПроцедуры

&НаКлиенте
Процедура НастроитьВидимостьДоступность() Экспорт
	
	МожноПланировать = (Объект.ВидСобытия <> ПредопределенноеЗначение("Перечисление.ВидыСобытий.ВходящееПисьмо") И
		Объект.ВидСобытия <> ПредопределенноеЗначение("Перечисление.ВидыСобытий.ВходящийЗвонок"));
	ЭтоЗвонок = (Объект.ВидСобытия = ПредопределенноеЗначение("Перечисление.ВидыСобытий.ВходящийЗвонок") Или
		Объект.ВидСобытия = ПредопределенноеЗначение("Перечисление.ВидыСобытий.ИсходящийЗвонок"));	
	
	Элементы.ДатаПлан.Доступность = МожноПланировать;
	Элементы.ДатаПланВремя.Доступность = Элементы.ДатаПлан.Доступность;
	Элементы.ПлановыйИсполнитель.Доступность = МожноПланировать;
	Элементы.Цель.Доступность = МожноПланировать;
	
	Элементы.ВидСобытия.Доступность = Не Объект.СозданАвтоматически;
	
	// Звонки
	Элементы.ГруппаЗвонок.Доступность = ЭтоЗвонок;
	Элементы.ФормаНачатьРазговор.Доступность = ЭтоЗвонок И ИспользоватьCallЦентр И Не Объект.ЗвонокНачат;
	Элементы.ФормаНачатьРазговорМонитор.Доступность = Элементы.ФормаНачатьРазговор.Доступность;	
	Элементы.ДлительностьВремя.Доступность = ЭтоЗвонок И ИспользоватьCallЦентр;
	
	// Phone
	Элементы.доп_НабранныйНомер.Видимость = Объект.ВидСобытия = ПредопределенноеЗначение("Перечисление.ВидыСобытий.ВходящийЗвонок");
	
	Длительность = Дата(1,1,1) + Объект.ДлительностьЗвонка;
	
	Элементы.ИсходЗвонка.АвтоОтметкаНезаполненного = ТипыЗвонкаСОбязательнымИсходом.НайтиПоЗначению(Объект.ТипЗвонка) <> Неопределено;
	
	Элементы.Обращение.Доступность = Не ЗначениеЗаполнено(Объект.Основание);
	Элементы.Основание.Доступность = Не ЗначениеЗаполнено(Объект.ИсточникИнформации);
	
	Элементы.Обращение.Заголовок = ?(ЗначениеЗаполнено(Объект.ИсточникИнформации), "Обращение (" + Строка(Объект.ИсточникИнформации) + ")", "Обращение");
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаАктивизации(АктивныйОбъект, Источник)
	
	НастроитьВидимостьДоступность();
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЕстьСотовыйТелефонУКлиента(Клиент)
	
	Запись = РегистрыСведений.КонтактнаяИнформация.СоздатьМенеджерЗаписи();
	Запись.Объект = Клиент;
	Запись.Тип = Перечисления.ТипыКонтактнойИнформации.Телефон;
	Запись.Вид = Справочники.ВидыКонтактнойИнформации.ТелефонСотовый;
	Запись.Прочитать();
	
	Возврат Запись.Выбран();
	
КонецФункции

&НаКлиенте
Процедура ДатаФактПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Объект.ДатаФакт) И Не ЗначениеЗаполнено(Объект.ФактическийИсполнитель) Тогда
		Объект.ФактическийИсполнитель = ОбщегоНазначения.ТекущийПользователь();	
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура НомерТелефонаРасширеннаяПодсказкаНажатие(Элемент)
	Объект.НомерТелефона = Элемент.Заголовок;
	ОбновитьПодсказкуНомераТелефона();
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьПодсказкуНомераТелефона()
	ТелефонныйНомерВБазе = ПолучитьНомерАвтоподстановки();
	
	Если НЕ ЗначениеЗаполнено(Объект.НомерТелефона) И ЗначениеЗаполнено(ТелефонныйНомерВБазе) Тогда
		Элементы.НомерТелефона.ОтображениеПодсказки = ОтображениеПодсказки.ОтображатьСнизу;
		Элементы.НомерТелефонаРасширеннаяПодсказка.Заголовок = ТелефонныйНомерВБазе;
	Иначе
		Элементы.НомерТелефона.ОтображениеПодсказки = ОтображениеПодсказки.Нет;
	КонецЕсли;
	
	ОбновитьКэшНомеровКлиента();
	ОбновитьПримечаниеТелефонногоНомера();
	ОбновитьДоступностьСохраненияНомераЗаконномуПредставителю();
КонецПроцедуры

&НаКлиенте
Процедура НомерТелефонаПриИзменении(Элемент)
	ОбновитьПодсказкуНомераТелефона();
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьКэшНомеровКлиента()
	Если ЗначениеЗаполнено(Объект.Клиент) Тогда
		ТелефоныКлиента = КонтактнаяИнформацияСерверПереопределяемый.ПолучитьТелефоныВладельца(Объект.Клиент);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьПримечаниеТелефонногоНомера()
	Если НЕ ЗначениеЗаполнено(Объект.Клиент) Тогда
		Возврат; 
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.НомерТелефона) Тогда
		ТекущийНомерНормализованный = КонтактнаяИнформацияКлиентСерверПереопределяемый.НормализоватьСотовыйТелефон(Объект.НомерТелефона).Номер;
	Иначе
		ТекущийНомерНормализованный = Неопределено;
	КонецЕсли;
	
	НомерАвтоподстановки = ПолучитьНомерАвтоподстановки();
	Если ЗначениеЗаполнено(НомерАвтоподстановки) Тогда
		НомерАвтоподстановкиНормализованный = КонтактнаяИнформацияКлиентСерверПереопределяемый.НормализоватьСотовыйТелефон(НомерАвтоподстановки).Номер;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТекущийНомерНормализованный) Тогда 
		Если НомерАвтоподстановкиНормализованный = ТекущийНомерНормализованный Тогда
			// Итак выбран самый основной телефон, дополнительной информации выводить не требуется	
			Элементы.ПримечаниеКНомеруТелефона.Заголовок = "";
		Иначе
			НомерЧислитсяВБазе = Ложь;
			ВидТекущегоНомера = Неопределено;
			
			Для Каждого ДанныеНомера Из ТелефоныКлиента Цикл
				НомерТелефонаНормализованный = 	КонтактнаяИнформацияКлиентСерверПереопределяемый.НормализоватьСотовыйТелефон(ДанныеНомера.Представление).Номер;
				Если НомерТелефонаНормализованный = ТекущийНомерНормализованный Тогда
					НомерЧислитсяВБазе = Истина;
					ВидТекущегоНомера = ДанныеНомера.Вид;
				КонецЕсли;
				
			КонецЦикла;
			Если НЕ НомерЧислитсяВБазе Тогда
				Если Не ЗначениеЗаполнено(НомерАвтоподстановки) Тогда
					Элементы.ПримечаниеКНомеруТелефона.Заголовок = НСтр("ru='Текущий номер телефона не зарегистрирован в базе.'");
				Иначе
					Элементы.ПримечаниеКНомеруТелефона.Заголовок = НСтр("ru=Текущий номер телефона не зарегистрирован в базе, но имеется номер для связи:'") + " " + Строка(НомерАвтоподстановки);
				КонецЕсли;
			Иначе
				Если Не ЗначениеЗаполнено(НомерАвтоподстановки) Тогда
					// Такого по не должно быть, т.к. любой номер имеющийся в базе должен найтись при поиске 
				Иначе
					Элементы.ПримечаниеКНомеруТелефона.Заголовок = НСтр("ru='Текущий номер телефона зарегистрирован в базе, но имеется отличный от него номер для связи:'") + " " + Строка(НомерАвтоподстановки);
				КонецЕсли;	
			КонецЕсли;	
		КонецЕсли;		
	Иначе
		Если ЗначениеЗаполнено(НомерАвтоподстановки) Тогда
			Элементы.ПримечаниеКНомеруТелефона.Заголовок = НСтр("ru='У клиента имеется заполненный основной телефон. Кликните по подсказке снизу.'");
		Иначе
			Элементы.ПримечаниеКНомеруТелефона.Заголовок = НСтр("ru='Нет данных о каких-либо номерах телефонов.'");
		КонецЕсли;
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Функция ПолучитьНомерАвтоподстановки()
	Возврат КонтактнаяИнформацияСерверПереопределяемый.НайтиКонтактнуюИнформацию(Объект.Клиент,,,,Ложь);
КонецФункции

&НаСервереБезКонтекста
Процедура ЗаписатьТелефонЗаконномуПредставителюНаСервере(Клиент, ЗаконныйПредставитель, НомерТелефона)
	Если ТипЗнч(ЗаконныйПредставитель) = Тип("Строка") Тогда
		КлиентОбъект = Клиент.ПолучитьОбъект();
		КлиентОбъект.ЗаконныйПредставительТелефон = НомерТелефона;
		КлиентОбъект.Записать();
	Иначе
		КонтактнаяИнформацияСерверПереопределяемый.ЗаписатьНомерТелефона(ЗаконныйПредставитель, НомерТелефона);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьДоступностьСохраненияНомераЗаконномуПредставителю()
	ДоступностьКнопки = Ложь;	
	Если ЗначениеЗаполнено(Объект.Клиент) Тогда
		ЗаконныйПредставитель = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Клиент, "ЗаконныйПредставитель");
		Если ЗначениеЗаполнено(ЗаконныйПредставитель) Тогда
			ДоступностьКнопки = Истина;
		КонецЕсли;
	КонецЕсли;
	
	Элементы.ЗаписатьТелефонЗаконномуПредставителю.Доступность = ДоступностьКнопки;
КонецПроцедуры

&НаКлиенте
Процедура ТипЗвонкаПриИзменении(Элемент) 
	
	Если ЗначениеЗаполнено(Объект.ТипЗвонка)
		И ЗначениеЗаполнено(Объект.ИсходЗвонка)
		И Не ИсходДопустимДляТипаЗвонка(Объект.ТипЗвонка, Объект.ИсходЗвонка)
	Тогда
		Объект.ИсходЗвонка = ПредопределенноеЗначение("Справочник.ИсходыЗвонка.ПустаяСсылка");	
	КонецЕсли;
	
	НастроитьВидимостьДоступность();
	
КонецПроцедуры 

&НаСервереБезКонтекста
Функция ИсходДопустимДляТипаЗвонка(ТипЗвонка, ИсходЗвонка)
	
	Запись = РегистрыСведений.ИсходыТиповЗвонковДопустимые.СоздатьМенеджерЗаписи();
	Запись.ТипЗвонка = ТипЗвонка;
	Запись.ИсходЗвонка = ИсходЗвонка;
	Запись.Прочитать();
	Если Запись.Выбран() Тогда
		Возврат Истина;
	Иначе
		Возврат Не ТипЗвонка.ИсходОбязателен;
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура ИсходЗвонкаАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ДанныеВыбора = ПолучитьДанныеВыбораДляИсходаЗвонка(СтандартнаяОбработка);
КонецПроцедуры

&НаСервереБезКонтекста
Функция ОтсутствуютЛистыОжиданияВведенныеНаОсновании(Событие)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЛистОжидания.Ссылка
		|ИЗ
		|	Документ.ЛистОжидания КАК ЛистОжидания
		|ГДЕ
		|	ЛистОжидания.Основание = &Основание";
	
	Запрос.УстановитьПараметр("Основание", Событие);
	
	Возврат Запрос.Выполнить().Выбрать().Количество() = 0;
	
КонецФункции

&НаКлиенте
Процедура ИсходЗвонкаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ДанныеВыбора = ПолучитьДанныеВыбораДляИсходаЗвонка(СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура ИсходЗвонкаПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Объект.ИсходЗвонка) И Не ЗначениеЗаполнено(Объект.ТипЗвонка) Тогда
		СтрокиТиповЗвонковПоИсходуЗвонка = ИсходыПоТипуЗвонка.НайтиСтроки(Новый Структура("ИсходЗвонка", Объект.ИсходЗвонка));
		Если СтрокиТиповЗвонковПоИсходуЗвонка.Количество() = 1 Тогда
			Объект.ТипЗвонка = СтрокиТиповЗвонковПоИсходуЗвонка[0].ТипЗвонка;  	
		КонецЕсли;
	КонецЕсли;	
		
КонецПроцедуры

&НаКлиенте
Функция ПолучитьДанныеВыбораДляИсходаЗвонка(СтандартнаяОбработка)
	
	ДанныеВыбора = Новый СписокЗначений;
	
	СтрокиИсходовПоТипуЗвонка = ИсходыПоТипуЗвонка.НайтиСтроки(Новый Структура("ТипЗвонка", Объект.ТипЗвонка));
	
	Если СтрокиИсходовПоТипуЗвонка.Количество() = 0 Тогда
		СтандартнаяОбработка = Истина;
	Иначе
		Для Каждого СтрокаТаблицы Из СтрокиИсходовПоТипуЗвонка Цикл
			ДанныеВыбора.Добавить(СтрокаТаблицы.ИсходЗвонка);
		КонецЦикла;
	КонецЕсли;
	
	Возврат ДанныеВыбора;
	
КонецФункции

&НаКлиенте
Процедура UTM_SOURCEПриИзменении(Элемент)
	НастроитьВидимостьДоступность();
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ПоказатьКомментарииКлиента(Клиент, ДекорацияПодсказкаКлиента, СтраницыКомментарий, СтраницаКнопка, СтраникаГиперссылка)
	
	ЕстьКомментарий = Ложь;
	
	Если ЗначениеЗаполнено(Клиент) Тогда
		КомментарииКлиента = ОбщегоНазначения.ПолучитьЗначенияРеквизитов(Клиент, "Комментарий, КраткийКомментарий");
		ПодсказкаКомментарии = СокрЛП(КомментарииКлиента.КраткийКомментарий);
		ОбщегоНазначенияКлиентСервер.КонкатенацияСтрок(ПодсказкаКомментарии, КомментарииКлиента.Комментарий, "; ", Истина);
		ПодсказкаКомментарии = СтрЗаменить(ПодсказкаКомментарии, Символы.ПС, " ");
	Иначе
		ПодсказкаКомментарии = "";
	КонецЕсли;
	
	Если ПустаяСтрока(ПодсказкаКомментарии) Тогда
		СтраницыКомментарий.ТекущаяСтраница = СтраницаКнопка;
	Иначе
		СтраницыКомментарий.ТекущаяСтраница = СтраникаГиперссылка;
		ДекорацияПодсказкаКлиента.Заголовок = ПодсказкаКомментарии;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьКомментарииКлиентаПослеИзменения(Результат, Параметры) Экспорт
	
	Если Результат = Истина Тогда
		ПоказатьКомментарииКлиента(Объект.Клиент, Элементы.ДекорацияПодсказкаКлиента, Элементы.СтраницыКомментария, Элементы.СтраницаКнопкаКомментарий, Элементы.СтраницаГиперссылкаКомментарий);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияПодсказкаКлиентаНажатие(Элемент)
	ОткрытьКомментарийКлиента(Неопределено);
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	// Добавлено Макеев (
	омг_ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтаФорма, ТекущийОбъект);
	// )
КонецПроцедуры

&НаКлиенте
Процедура омг_ПослеВыбораНоменклатуры() 

		Для Каждого СтрокаТаблицы Из Объект.Работы Цикл 
				ЗаголовокСпециализации = "" + ЗаголовокСпециализации + СтрокаТаблицы.Номенклатура + "; "+Символы.ПС;
		КонецЦикла;
		Элементы.Декорация2.Заголовок = "Услуги по прайсу: " +ЗаголовокСпециализации;

КонецПроцедуры

 &НаКлиенте
Процедура Подбор(Команда)
	
	РаботаСФормамиКлиент.КнопкаПодборПриНажатии(ЭтаФорма, "Работы");	
	Элементы.ГруппаПодбор.Ширина = 50;
	Элементы.ГруппаНомерДата.Видимость = не Элементы.ГруппаПодбор.Видимость;
	Элементы.ГруппаПациент.Видимость = не Элементы.ГруппаПодбор.Видимость;
	Элементы.ГруппаЗвонок.Видимость = не Элементы.ГруппаПодбор.Видимость;
	Элементы.ГруппаИсполнительПланФакт.Видимость = не Элементы.ГруппаПодбор.Видимость;
	Элементы.ГруппаНомерТелефона.Видимость = не Элементы.ГруппаПодбор.Видимость;
	Элементы.ГруппаОтветственный.Видимость = не Элементы.ГруппаПодбор.Видимость;
	Элементы.Работы.Видимость    = Элементы.ГруппаПодбор.Видимость;
	Элементы.ГруппаЛевая.Ширина = ?(Элементы.ГруппаПодбор.Видимость,10,0);
	омг_ПослеВыбораНоменклатуры(); 
	
КонецПроцедуры

&НаКлиенте
Процедура омг_ПослеВыбораФилиала(Результат,ДопПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;  
	
	ЭтаФорма.РеквизитСписокПодбор.Параметры.УстановитьЗначениеПараметра("омг_Филиал", Объект.Филиал);
	ЭтаФорма.РеквизитСписокПодбор.Параметры.УстановитьЗначениеПараметра("Омг_ТолькоСЦенами",?(ЗначениеЗаполнено(Объект.Филиал),Истина,Ложь));	
	РаботаСформамиКЛиент.ОбновитьДинамическийСписокПринудительно(ЭтаФорма.РеквизитСписокПодбор);
	
КонецПроцедуры    

&НаКлиенте
Процедура Подключаемый_ВыборПодбор(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	// Добавлено Макеев (
	Если Элемент.ТекущиеДанные.Приостановлено И Не ВыбранноеЗначение = Неопределено Тогда
		
		ТекстВопроса = "Исследование было приостановлено лабораторией. Продолжить добавление в документ?";
		ОписаниеОповещения = Новый ОписаниеОповещения("Обработчик_ПослеОтветаНаВопросОДобавленииПриостановленного", ЭтаФорма, 
			Новый Структура("Подбор, ВыбранноеЗначение", Элемент, ВыбранноеЗначение));
		ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет, 60, КодВозвратаДиалога.Да, "", КодВозвратаДиалога.Нет);
		
		Возврат;
	КонецЕсли;
	// )
	
	ОбработкаВводаНоменклатуры(ВыбранноеЗначение, 1); 
	
	Модифицированность = Истина;
	
КонецПроцедуры  

&НаСервере
Функция ОбработкаВводаНоменклатуры(Номенклатура, Количество = 1, ПозицияВводаСтроки = Неопределено, РучноеРедактирование = Ложь)
	
	// Изменения Макеев 07-12-2025 (
	Если Номенклатура.ЭтоГруппа Тогда
		Возврат "";
	КонецЕсли;
	
	Если Номенклатура.Пустая() Или Номенклатура.ВидНоменклатуры = Перечисления.ВидыНоменклатуры.Услуга Тогда
		ОбработкаВнесенияРаботы(Номенклатура, Количество, ПозицияВводаСтроки, Объект, РучноеРедактирование);
	ИначеЕсли Номенклатура.ВидНоменклатуры = Перечисления.ВидыНоменклатуры.Набор Тогда
		СоставНабора = ОбщегоНазначенияСервер.ПолучитьСоставНабора(Номенклатура);
		МассивНаборов = Новый Массив;
		МассивКомплектующих = Новый Массив; 
		МассивНаборов.Добавить(Номенклатура);
		омг_ПолучитьВсеНаборы(СоставНабора,МассивНаборов,МассивКомплектующих);
		Для Каждого СтрокаСостава Из МассивКомплектующих Цикл
			// Изменено Макеев ( 
			Если не СтрокаСостава.омг_Набор = Номенклатура Тогда
			омг_НаборУровень = СтрокаСостава.омг_Набор
			иначе
			омг_НаборУровень = Неопределено
			КонецЕсли;
			ОбработкаВнесенияРаботы(СтрокаСостава.Комплектующая, СтрокаСостава.Количество*Количество, ПозицияВводаСтроки, Объект,, Номенклатура,омг_НаборУровень, СтрокаСостава.ЭтоНаборЛИС);
			// )
			Если ПозицияВводаСтроки <> Неопределено Тогда
				ПозицияВводаСтроки = ПозицияВводаСтроки + 1;
			КонецЕсли;
		КонецЦикла;
	Иначе
		Возврат Строка("Номенклатура "+Строка(Номенклатура)+" не является работой. Допускается только подбор работ.");
	КонецЕсли; 
	
	Возврат "";
	
КонецФункции       

 &НаСервере
Процедура омг_ПолучитьВсеНаборы(СоставИсходногоНабора,МассивНаборов,МассивКомплектующих)
		
	Для каждого строка из СоставИсходногоНабора Цикл
		Если строка.Комплектующая.ВидНоменклатуры = Перечисления.ВидыНоменклатуры.Набор Тогда
			МассивНаборов.добавить(строка.Комплектующая);
			СоставНабора = ОбщегоНазначенияСервер.ПолучитьСоставНабора(строка.Комплектующая);
			омг_ПолучитьВсеНаборы(СоставНабора,МассивНаборов,МассивКомплектующих);
		иначе
			МассивКомплектующих.добавить(строка)
		КонецЕсли;	
	КонецЦикла;	
	
КонецПроцедуры	      

&НаСервере
Процедура ОбработкаВнесенияРаботы(Номенклатура, Количество, ПозицияВводаСтроки, ДокументОбъект, 
	РучноеРедактирование = Ложь, Набор = Неопределено,омг_НаборУровень= Неопределено, ЭтоНаборЛИС = Ложь)

	Если Количество = 0 Тогда
		Количество = 1;
	КонецЕсли;
	
	Если ПозицияВводаСтроки <> Неопределено
		И ПозицияВводаСтроки < (ДокументОбъект.Работы.Количество() - 1)
		Тогда
		СтрокаРаботы = ДокументОбъект.Работы[ПозицияВводаСтроки];
	Иначе
		СтруктураПоиска = Новый Структура("Номенклатура", Номенклатура);
		Если Набор = Неопределено Тогда 
			СтруктураПоиска.Вставить("омг_Набор", Справочники.Номенклатура.ПустаяСсылка());
		Иначе
			СтруктураПоиска.Вставить("омг_Набор", Набор);
		КонецЕсли;
		СуществующиеСтрокиРабот = ДокументОбъект.Работы.НайтиСтроки(СтруктураПоиска);
		Если СуществующиеСтрокиРабот.Количество() > 0 Тогда
		Иначе
			СтрокаРаботы = ДокументОбъект.Работы.Добавить(); 
			СтрокаРаботы.Номенклатура = Номенклатура;
			
			ЭтаФорма.Элементы.Работы.ТекущаяСтрока = СтрокаРаботы.ПолучитьИдентификатор();
			
			СтрокаРаботы.омг_Набор = Набор;
			Если не омг_НаборУровень = Неопределено Тогда
				СтрокаРаботы.омг_НаборУровень = омг_НаборУровень;
			КонецЕсли;
			Если ЭтоНаборЛИС Тогда
				СтрокаРаботы.омг_НаборЛИС = омг_НаборУровень;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура Декорация2Нажатие(Элемент)
	Подбор("")
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если не ПараметрыЗаписи.Свойство("ПропуститьПроверку") Тогда 
		Если не Объект.ВидПриема = ПредопределенноеЗначение("Перечисление.ВидыПриемов.Первичный") 
			и не Объект.ВидПриема = ПредопределенноеЗначение("Перечисление.ВидыПриемов.Вторичный") Тогда
			Отказ = Истина; 
			Сообщить("Заполните вид приема!",СтатусСообщения.Важное);
		КонецЕсли;   
		
		Если не Объект.НаправлениеНовый = ПредопределенноеЗначение("Перечисление.ВидыНаправлений.Платно") 
			и не Объект.НаправлениеНовый = ПредопределенноеЗначение("Перечисление.ВидыНаправлений.Страховка") Тогда
			Отказ = Истина;
			Сообщить("Заполните направление!",СтатусСообщения.Важное);
		КонецЕсли;
	КонецЕсли;	
	
КонецПроцедуры
